tutorials/particleInjection2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Using standard OpenFOAM solver with adaptiveFvMesh library loaded
// Note: For kinematicCloud, the standard OpenFOAM cloud machinery handles
// particle tracking during mesh changes. The cloudSupport module in this
// library specifically handles passiveParticleCloud.
application     icoUncoupledKinematicParcelDyMFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.1;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.02;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

libs
(
    libamrDynamicFvMesh.so
    libamrIndicators.so
    libamrDynamicMesh.so
    libamrLagrangian.so
);


// ************************************************************************* //
