tutorials/particleInjection2D/constant/kinematicCloudPositions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       vectorField;
    object      kinematicCloudPositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// 10 deterministic injection positions at inlet (x=0, y uniformly distributed, z=0.005)
(
    (0.001 0.01 0.005)
    (0.001 0.02 0.005)
    (0.001 0.03 0.005)
    (0.001 0.04 0.005)
    (0.001 0.051 0.005)
    (0.001 0.06 0.005)
    (0.001 0.07 0.005)
    (0.001 0.08 0.005)
    (0.001 0.09 0.005)
    (0.001 0.095 0.005)
)

// ************************************************************************* //
